Data frames are the heart of the pandas library. Conceptually they are a 2 dimensional data structure with rows and columns, where each row is a series and each columnt is also a series. They are very similar to a spreadsheet or a SQL table.

# Example

In [3]:
import pandas as pd

record1 = pd.Series({'Name': 'Alice',
                        'Class': 'Physics',
                        'Score': 85})
record2 = pd.Series({'Name': 'Jack',
                        'Class': 'Chemistry',
                        'Score': 82})
record3 = pd.Series({'Name': 'Helen',
                        'Class': 'Biology',
                        'Score': 90})

In [7]:
df = pd.DataFrame([record1, record2, record3], ['school1', 'school2', 'school1'])

df.head()

          Name      Class  Score
school1  Alice    Physics     85
school2   Jack  Chemistry     82
school1  Helen    Biology     90

An alternative method is using a list of dictionaries. Each dictionary represents a row in the data frame. The keys of the dictionary represent the column names and the values represent the data in the row.

In [9]:
students = [{'Name': 'Alice', 'Class': 'Physics', 'Score': 85},
            {'Name': 'Jack', 'Class': 'Chemistry', 'Score': 82},
            {'Name': 'Helen', 'Class': 'Biology', 'Score': 90}]

df = pd.DataFrame(students, index=['school1', 'school2', 'school1'])

df.head()

          Name      Class  Score
school1  Alice    Physics     85
school2   Jack  Chemistry     82
school1  Helen    Biology     90

In [11]:
df.loc['school2']

Name          Jack
Class    Chemistry
Score           82
Name: school2, dtype: object

In [15]:
type(df.loc['school2']) #return as a series

pandas.core.series.Series

In [13]:
df.loc['school1']

          Name    Class  Score
school1  Alice  Physics     85
school1  Helen  Biology     90

In [14]:
type(df.loc['school1']) #return as a dataframe

pandas.core.frame.DataFrame

# We can select data based on multiple access

In [18]:
df.loc['school1', "Name"]

school1    Alice
school1    Helen
Name: Name, dtype: object

In [ ]:
df.loc['school1']['Name']

school1    Alice
school1    Helen
Name: Name, dtype: object

In [20]:
df.T

       school1    school2  school1
Name     Alice       Jack    Helen
Class  Physics  Chemistry  Biology
Score       85         82       90

In [22]:
df.T.loc['Name']

school1    Alice
school2     Jack
school1    Helen
Name: Name, dtype: object

# In pandas the index operator [] is used to access columns of a data frame. The index operator can only be used to access columns, not rows.

In [24]:
df

          Name      Class  Score
school1  Alice    Physics     85
school2   Jack  Chemistry     82
school1  Helen    Biology     90

In [30]:
df['Name'] #we cannot use df.loc['Name'] because it is not a label

school1    Alice
school2     Jack
school1    Helen
Name: Name, dtype: object

In [32]:
# the result of a column projection is a Series
type(df['Name'])

pandas.core.series.Series

## Since the result of using the index operator is a series, we can use the index operator again to access data in the series. We can basically chain operations together.

In [34]:
df.loc['school1']['Name']

school1    Alice
school1    Helen
Name: Name, dtype: object

In [38]:
df.loc['school1'] #it is a dataframe

          Name    Class  Score
school1  Alice  Physics     85
school1  Helen  Biology     90

In [39]:
print(type(df.loc['school1'])) #it is a dataframe

<class 'pandas.core.frame.DataFrame'>

In [40]:
df.loc['school1']['Name'] #it is a series

school1    Alice
school1    Helen
Name: Name, dtype: object

In [41]:
print(type(df.loc['school1']['Name'])) #it is a series

<class 'pandas.core.series.Series'>

# Chaining, by indexing on the return type of another index, can come with some costs. 

When chaining operations pandas tend to return a copy of the data frame instead of a view on the data frame. For large data frames this can become very slow and can cause performance issues.

In [42]:
df

          Name      Class  Score
school1  Alice    Physics     85
school2   Jack  Chemistry     82
school1  Helen    Biology     90

In [43]:
# if we want to select all the rows, we can use a slice and the select the particular columns we are interested in

df.loc[:, ['Name', 'Score']]

          Name  Score
school1  Alice     85
school2   Jack     82
school1  Helen     90

# MORAL OF THE STORY: TRY TO AVOID CHAINING OPERATIONS IN PANDAS

# Deleting data by using the drop method

In [45]:
df.drop('school1')

         Name      Class  Score
school2  Jack  Chemistry     82

In [47]:
df # the drop method does not change the original dataframe

          Name      Class  Score
school1  Alice    Physics     85
school2   Jack  Chemistry     82
school1  Helen    Biology     90

# to change the data frame we need to use the optional parameter inplace=True in the drop method